wagiminator/SAMD-Development-Boards/ArduinoCore-samd/boards.txt
d21e.menu.cpu.samd21e15b=SAMD21E15B
d21e.menu.cpu.samd21e15b.upload.maximum_size=24576
d21e.menu.cpu.samd21e15b.build.extra_flags=-D__SAMD21E15B__ {build.usb_flags} -DARM_MATH_CM0PLUS
d21e.menu.cpu.samd21e15b.build.ldscript=flash_32KB.ld
d21e.menu.cpu.samd21e15b.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
d21e.menu.cpu.samd21e15b.bootloader.file=sam_ba_SAMD21E_DevBoard_SAMD21E15B.bin

d21e.menu.bootloader.8kb=8kB Bootloader
d21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
d21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
d21e.menu.bootloader.8kb.upload.tool=SAMD_DevBoards:bossac
d21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
d21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
d21e.menu.bootloader.8kb.upload.native_usb=true

#d21e.menu.bootloader.16kb=16kB Bootloader
#d21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
#d21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
#d21e.menu.bootloader.16kb.upload.tool=SAMD_DevBoards:bossac
#d21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
#d21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
#d21e.menu.bootloader.16kb.upload.native_usb=true

d21e.menu.bootloader.0kb=No Bootloader
d21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d21e.menu.bootloader.0kb.upload.tool=arduino:openocd
d21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
d21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
d21e.menu.bootloader.0kb.upload.native_usb=false

d21e.menu.serial.one_uart=1x UART, 1x WIRE, 1x SPI
d21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
d21e.menu.serial.one_uart_one_wire_two_spi=1x UART, 1x WIRE, 2x SPI
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
d21e.menu.serial.one_uart_two_wire_one_spi=1x UART, 2x WIRE, 1x SPI
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
d21e.menu.serial.two_uart=2x UART, 1x WIRE, 1x SPI
d21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
d21e.menu.serial.three_uart_one_wire_no_spi=3x UART, 1x WIRE, 0x SPI
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
d21e.menu.serial.three_uart_no_wire_one_spi=3x UART, 0x WIRE, 1x SPI
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d21e.menu.serial.four_uart=4x UART, 0x WIRE, 0x SPI
d21e.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
d21e.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
d21e.menu.serial.four_uart.build.serialcom_spi=NO_SPI
d21e.menu.serial.no_uart_one_wire_two_spi=0x UART, 1x WIRE, 2x SPI
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI

d21e.menu.usb.cdc=CDC only
d21e.menu.usb.cdc.build.usbcom=CDC_ONLY
d21e.menu.usb.cdc.build.pid=0x0557
d21e.menu.usb.hid=HID only
d21e.menu.usb.hid.build.usbcom=HID_ONLY
d21e.menu.usb.hid.build.pid=0x0B40
d21e.menu.usb.cdc_hid=CDC & HID
d21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
d21e.menu.usb.cdc_hid.build.pid=0x0856
d21e.menu.usb.withcdc=with CDC
d21e.menu.usb.withcdc.build.usbcom=WITH_CDC
d21e.menu.usb.withcdc.build.pid=0x0B41
d21e.menu.usb.nocdc=without CDC
d21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d21e.menu.usb.nocdc.build.pid=0x0A0C
d21e.menu.usb.none=USB disabled
d21e.menu.usb.none.build.usbcom=USB_DISABLED
d21e.menu.usb.none.build.pid=0x0856


# =================================================================
# SAMD11C14A DevBoard
# =================================================================
d11c14a.name=SAMD11C DevBoard
d11c14a.vid.0=0x16D0
d11c14a.pid.0=0x0557
d11c14a.vid.1=0x16D0
d11c14a.pid.1=0x0856
d11c14a.vid.2=0x16D0
d11c14a.pid.2=0x0B41
d11c14a.vid.3=0x16D0
d11c14a.pid.3=0x0B40
d11c14a.vid.4=0x16D0
d11c14a.pid.4=0x0A0C
d11c14a.vid.5=0x16D0
d11c14a.pid.5=0x0856
d11c14a.build.mcu=cortex-m0plus
d11c14a.build.mathlib=arm_cortexM0l_math
d11c14a.build.f_cpu=48000000L
d11c14a.build.usb_product="SAMD11C DevBoard"
d11c14a.build.usb_manufacturer="Wagiminator"
d11c14a.build.board=SAMD_ZERO
d11c14a.build.core=arduino
d11c14a.build.variant=SAMD11C
d11c14a.build.variant_system_lib=
d11c14a.build.vid=0x16D0
d11c14a.upload.protocol=sam-ba
d11c14a.bootloader.tool=arduino:openocd

d11c14a.menu.float.default=Print & String use auto-promoted doubles only
d11c14a.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
d11c14a.menu.float.print=Print uses separate singles and doubles
d11c14a.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
d11c14a.menu.float.string=String uses separate singles and doubles
d11c14a.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
d11c14a.menu.float.both=Print & String use separate singles and doubles
d11c14a.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
d11c14a.menu.config.disabled=config.h disabled
d11c14a.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
d11c14a.menu.config.enabled=config.h enabled (mostly code size reductions)
d11c14a.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED

d11c14a.menu.clock.internal_usb=Internal USB Calibrated Oscillator
d11c14a.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11c14a.menu.clock.internal=Internal Oscillator
d11c14a.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
# d11c14a.menu.clock.crystal_32k=32kHz Crystal
# d11c14a.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
# d11c14a.menu.clock.crystal_hs=High Speed Crystal
# d11c14a.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL

d11c14a.menu.timer.timer_732Hz=732.4Hz (16-bit)
d11c14a.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
d11c14a.menu.timer.timer_366Hz=366.2Hz (16-bit)
d11c14a.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
d11c14a.menu.timer.timer_244Hz=244.1Hz (16-bit)
d11c14a.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
d11c14a.menu.timer.timer_183Hz=183.1Hz (16-bit)
d11c14a.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
d11c14a.menu.timer.timer_146Hz=146.5Hz (16-bit)
d11c14a.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
d11c14a.menu.timer.timer_122Hz=122.1Hz (16-bit)
d11c14a.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
d11c14a.menu.timer.timer_105Hz=104.6Hz (16-bit)
d11c14a.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
d11c14a.menu.timer.timer_81Hz=81.38Hz (16-bit)
d11c14a.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
d11c14a.menu.timer.timer_61Hz=61.04Hz (16-bit)
d11c14a.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
d11c14a.menu.timer.timer_31Hz=30.52Hz (16-bit)
d11c14a.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
d11c14a.menu.timer.timer_187500Hz=187500Hz (8-bit)
d11c14a.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
d11c14a.menu.timer.timer_93750Hz=93750Hz (8-bit)
d11c14a.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
d11c14a.menu.timer.timer_62500Hz=62500Hz (8-bit)
d11c14a.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
d11c14a.menu.timer.timer_37500Hz=37500Hz (8-bit)
d11c14a.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
d11c14a.menu.timer.timer_20833Hz=20833Hz (8-bit)
d11c14a.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
d11c14a.menu.timer.timer_12500Hz=12500Hz (8-bit)
d11c14a.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
d11c14a.menu.timer.timer_7500Hz=7500Hz (8-bit)
d11c14a.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
d11c14a.menu.timer.timer_4166Hz=4166Hz (8-bit)
d11c14a.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
d11c14a.menu.timer.timer_2930Hz=2930Hz (8-bit)
d11c14a.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
d11c14a.menu.timer.timer_1465Hz=1465Hz (8-bit)
d11c14a.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz

d11c14a.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
d11c14a.build.ldscript=flash_16KB.ld
d11c14a.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
d11c14a.bootloader.file=sam_ba_SAMD11C_DevBoard_SAMD11C14A.bin

d11c14a.menu.bootloader.4kb=4kB Bootloader
d11c14a.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11c14a.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11c14a.menu.bootloader.4kb.upload.tool=SAMD_DevBoards:bossac
d11c14a.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11c14a.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11c14a.menu.bootloader.4kb.upload.native_usb=true
d11c14a.menu.bootloader.4kb.upload.maximum_size=12288

